---
kind: property
id: P:Autodesk.Revit.DB.DimensionSegmentArray.Size
source: html/3aa3ea05-474f-f2d6-f8c9-dc821fcfc782.htm
---
# Autodesk.Revit.DB.DimensionSegmentArray.Size Property

Returns the number of objects that are in the array.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```